---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallUserHeightParam
source: html/8fec0b2e-629a-402d-b7f0-a0602dcb3c23.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallUserHeightParam Property

"Unconnected Height"

## Syntax (C#)
```csharp
public static ForgeTypeId WallUserHeightParam { get; }
```